{
  "What is the penalty for driving without a license?": "As per Section 181 of the Motor Vehicles Act 1988, driving without a valid license is punishable with a fine of ₹5,000. This applies to all motor vehicles and is a serious traffic violation.",
  "What is the fine for driving without a driving license?": "Under Section 181 of the Motor Vehicles Act, the penalty for driving without a valid license is ₹5,000. This is applicable across all states in India.",
  "Can I drive without a license?": "No, driving without a valid license is illegal under Section 181 of the Motor Vehicles Act 1988. You can face a fine of ₹5,000 for this violation.",
  "What happens if caught driving without license?": "If caught driving without a license, you will be fined ₹5,000 under Section 181 of the Motor Vehicles Act. The vehicle may also be impounded.",
  "What is the minimum age for driving license?": "As per Section 4 of the Motor Vehicles Act, the minimum age for obtaining a driving license is 18 years for cars and motorcycles above 50cc. For gearless motorcycles up to 50cc, the minimum age is 16 years with parental consent.",
  "Can a minor obtain a driving license under the MV Act?": "No, minors (below 18 years) cannot obtain a regular driving license under Section 4 of the Motor Vehicles Act. However, 16-year-olds can get a learner's license for gearless vehicles up to 50cc with parental consent.",
  "What is the fine for not wearing a helmet?": "As per Section 194D of the Motor Vehicles Act, riding a two-wheeler without a helmet incurs a fine of ₹1,000 and possible driving license suspension for three months.",
  "Is helmet mandatory for bike riders?": "Yes, wearing a helmet is mandatory for all two-wheeler riders and pillion passengers under Section 194D. The fine for non-compliance is ₹1,000.",
  "What is the penalty for not wearing helmet while riding?": "Under Section 194D, not wearing a helmet while riding a two-wheeler attracts a fine of ₹1,000 and potential license suspension for three months.",
  "Can pillion rider be fined for not wearing helmet?": "Yes, both the rider and pillion passenger can be fined ₹1,000 each under Section 194D for not wearing helmets.",
  "What is the punishment for overspeeding?": "Section 183 outlines penalties for overspeeding: for light motor vehicles, the fine is ₹1,000-₹2,000; for medium/heavy vehicles, it's ₹2,000-₹4,000. Repeat offenders may face license suspension.",
  "What is the fine for speed limit violation?": "Under Section 183, speeding fines are ₹1,000-₹2,000 for light vehicles and ₹2,000-₹4,000 for heavy vehicles. License impoundment is possible for repeated violations.",
  "What happens if I exceed speed limit?": "Exceeding speed limits under Section 183 results in fines of ₹1,000-₹4,000 depending on vehicle type. Repeated violations can lead to license suspension.",
  "What is the penalty for drunk driving?": "Section 185 prescribes imprisonment up to 6 months and/or fine up to ₹2,000 for first-time drunk driving. Repeat offenses within 3 years attract imprisonment up to 2 years and/or fine up to ₹3,000.",
  "What is the fine for driving under influence of alcohol?": "Under Section 185, drunk driving penalties include imprisonment up to 6 months and/or fine up to ₹2,000 for first offense. Subsequent offenses have higher penalties.",
  "What is the blood alcohol limit for driving?": "As per Section 185, the blood alcohol content limit is 30mg per 100ml of blood. Exceeding this limit constitutes drunk driving.",
  "What happens if I drive a vehicle without a valid registration?": "As per Section 192, driving an unregistered vehicle is punishable with a fine up to ₹5,000 for the first offense and ₹10,000 or imprisonment up to 7 years for subsequent offenses.",
  "Is third party insurance mandatory?": "Yes, third-party insurance is mandatory under Section 146 of the Motor Vehicles Act. Driving without valid insurance attracts penalties under Section 196.",
  "What is the fine for driving without insurance?": "Under Section 196, driving without valid insurance can result in imprisonment up to 3 months and/or fine up to ₹1,000 for first offense.",
  "What happens if vehicle registration expires?": "Driving with expired registration is treated as driving an unregistered vehicle under Section 192, attracting fines up to ₹5,000 for first offense.",
  "What is the penalty for jumping red light?": "Under Section 177, violating traffic signals including red light jumping attracts a fine of ₹1,000-₹5,000 depending on the state's rules.",
  "What is the fine for not following traffic rules?": "Section 177 covers general traffic rule violations with fines typically ranging from ₹500 to ₹5,000 depending on the specific violation and state rules.",
  "What happens if I don't stop at red light?": "Jumping red lights is a violation under Section 177, typically attracting fines of ₹1,000-₹5,000. It may also result in license endorsement.",
  "What is the penalty for not having pollution certificate?": "Under Section 190, driving without a valid Pollution Under Control (PUC) certificate attracts a fine of ₹1,000-₹10,000 depending on the vehicle type.",
  "Is pollution certificate mandatory?": "Yes, a valid Pollution Under Control certificate is mandatory under Section 190. The vehicle can be impounded if the certificate is not available.",
  "What is the fine for not wearing seat belt?": "Not wearing seat belts typically attracts a fine of ₹1,000 under various state motor vehicle rules, though the specific section varies by state.",
  "Is wearing seat belt mandatory?": "Yes, wearing seat belts is mandatory for drivers and front-seat passengers in cars. The fine for non-compliance is typically ₹1,000.",
  "What is the penalty for using mobile phone while driving?": "Using mobile phones while driving is typically covered under Section 177 for traffic rule violations, with fines ranging from ₹1,000-₹5,000.",
  "Can I use phone while driving?": "No, using mobile phones while driving is prohibited and can attract fines under Section 177 for violating traffic rules.",
  "What is the golden hour in the MV Act?": "The 'golden hour' refers to the one-hour period following a traumatic injury where prompt medical treatment can significantly improve survival chances, as defined in Section 2(12A) of the Motor Vehicles Act.",
  "What does golden hour mean in motor vehicle act?": "Section 2(12A) defines 'golden hour' as the critical one-hour window after an accident when immediate medical care can save lives. The Act mandates provisions for emergency medical care during this period.",
  "Are vehicle modifications allowed?": "Vehicle modifications that alter fundamental characteristics require approval from the RTO under Section 52. Unauthorized modifications can attract penalties under Section 192.",
  "What is the penalty for illegal vehicle modification?": "Illegal vehicle modifications without RTO approval can be treated as altering vehicle characteristics under Section 192, attracting fines and possible vehicle seizure.",
  "What are the rules for learner's license?": "Section 14 governs learner's licenses. L-plate display is mandatory, accompanied driving by license holder required, and specific routes may be restricted.",
  "Can I drive alone with learner's license?": "No, learner's license holders must be accompanied by a person holding a valid driving license while driving, as per Section 14.",
  "What is the penalty for hit and run?": "Hit and run cases are covered under Section 161 for not providing information after accidents. Under the new criminal laws, it may also attract charges under Bharatiya Nyaya Sanhita Section 106.",
  "What happens in hit and run cases?": "Hit and run involves leaving the accident scene without providing assistance or information. It attracts serious penalties under both Motor Vehicles Act and criminal law.",
  "What is the penalty for vehicle overloading?": "Section 194 covers penalties for overloading, with fines of ₹2,000-₹20,000 depending on the extent of overloading and vehicle type.",
  "Is vehicle overloading illegal?": "Yes, vehicle overloading beyond prescribed limits is illegal under Section 194 and attracts substantial fines and possible vehicle detention.",
  "What documents are required while driving?": "Essential documents include valid driving license, vehicle registration certificate, insurance certificate, and PUC certificate. These must be produced when demanded by authorities.",
  "What happens if I don't carry driving documents?": "Not carrying required documents can attract penalties under various sections - typically fines ranging from ₹500-₹5,000 depending on the missing document.",
  "What is vehicle fitness certificate?": "Commercial vehicles require fitness certificates under Section 56 to ensure roadworthiness. The certificate must be renewed periodically as prescribed.",
  "Is fitness certificate mandatory for private vehicles?": "Fitness certificates are primarily mandatory for commercial vehicles under Section 56. Private vehicles generally don't require fitness certificates unless specifically prescribed.",
  "What powers do traffic police have?": "Traffic police have powers under Section 206 to check documents, impose penalties, detain vehicles, and take action against traffic violations.",
  "Can traffic police detain my vehicle?": "Yes, under Section 206, traffic police can detain vehicles for serious violations, lack of proper documents, or when the vehicle poses a public danger.",
  "What is e-challan system?": "E-challan is an electronic system for issuing traffic violation notices. It allows automatic detection and penalization of traffic violations through cameras and digital systems.",
  "How does e-challan work?": "E-challan system uses cameras and sensors to detect violations automatically, generates electronic challans, and sends notices to vehicle owners' registered addresses."
}